// На входе n – количество элементов массива. Далее производится заполнение
// массива с клавиатуры. Необходимо вывести значения массива без дублирования.
// Если длина массива равна 0, то вывести ‘Массив пуст’. Добавить проверку на ввод
// только чисел после каждого введенного элемента.
// 1, 1, 3, 4, 4, 4, 2, 5 -> 1, 2, 3, 4, 5

const n = prompt('введите количество элементов массива');
let arr = [];
let new_arr = [];

for (let i = 0; i < n; i++) {
    arr.push(prompt());
}
console.log(arr);

for (let i = 0; i < arr.length; i++) {
    if (!isNaN(arr[i]) && !new_arr.includes(arr[i])) {
        new_arr.push(arr[i])
    }
}

console.log(new_arr.length == 0 ? 'массив пуст' : new_arr);